do
    function run(msg, matches)
        
  local text = [[
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹

📝 ليست دستورات ابزار ها :

🛠 جستجو یک کاربر در گیت هاب
!git [یوزرنیم کاربر]

🚥 جستجو در گوگل
!google (متن)

🎎 جستجو کاربر در اینستاگرام
!insta (یوزرنیم اینستا)

📺 جستجو ویدیو در آپارات
!aparat (متن)

📑 جستجوی یک متن در ویکی پدیا
!wikifa (متن)

🎭 جستجو و دریافت گیف
!gif (متن)

🕋 دریافت وقت اذان یک شهر
!azan (شهر)

🔘 کوتاه کردن لینک
(لینک با http شروع شود)
!shortlink [لینک]

🏨 دریافت مکان مورد نظر از گوگل
!gps (شهر) (کشور)

🌠 تبدیل عکس به استیکر (ریپلی)
!tosticker

🌠 تبدیل استیکر به عکس (ریپلی)
!tophoto

🔢 انجام محاسبات ریاضی 
!calc 4-2

💸 دریافت نرخ ارز و سکه
!arz

📔 دریافت فال حافظ
!fal

⏱ دریافت زمان یک شهر 
!time (نام شهر)

🌞 دریافت وضعیت آب و هوا
!weather (نام شهر)

🎫 ساخت استیکر متنی
!sticker [متن]

🎛 تولید بارکد QR
!qr (متن)

😂 ارسال جوک 
!joke

🤔 ارسال دانستنی
!danestani

🎼 دانلود آهنگ درخواستی
!music (نام آهنگ)

✏️  زیبا سازی متن با حروف فانتزی
!write [متن]

🎺 دریافت متن به صورت صدا
!vc [متن]

🌅 دریافت اسکرین شات از یک سایت
(آدرس را حتما با http بنویسید)
!webshot [آدرس سایت]

🔤 ترجمه متن
!tr [fa/en] [متن]

🔄 خرید و شارژ گروه ضد اسپم
!buy

🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
]]
    return text
  end
end 

return {
  description = "tools for bot.  ", 
  usage = {
    "Show Tools Bot Info.",
  },
  patterns = {
    "^[!/]([Tt]ools)$",
  }, 
  run = run,
}
